Update documentation
